---
kind: method
id: M:Autodesk.Revit.DB.RadialArray.IsRotationAngleValid(System.Double)
source: html/36ec5016-3a12-dbe9-1d5d-e0c723b978f3.htm
---
# Autodesk.Revit.DB.RadialArray.IsRotationAngleValid Method

This indicates whether the input angle is valid.

## Syntax (C#)
```csharp
public static bool IsRotationAngleValid(
	double angle
)
```

## Parameters
- **angle** (`System.Double`) - The angle.

## Returns
True if the value of angle is not zero, false otherwise.